Revit 2024 API
ExternalResourceServerExtensions.GetRevitLinkOperations Method
 Gets the specific methods supported by the external resource of Revit Links.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public RevitLinkOperations GetRevitLinkOperations()
Visual Basic
Public Function GetRevitLinkOperations As RevitLinkOperations
Visual C++
public:
RevitLinkOperations^ GetRevitLinkOperations()
Return Value
 The specific methods supported by the external resource of Revit Links.
See Also
ExternalResourceServerExtensions Class
Autodesk.Revit.DB Namespace